[
    {
        "city": "Hải Phòng",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "0",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "0"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Hải Phòng đẹp trong cả 4 mùa. Mùa đông, thưởng thức ẩm thực đường phố nóng hổi. Mùa hè, đi biển, thưởng thức dừa dầm và hoa phượng nở rộ. Mỗi mùa đều mang đến trải nghiệm độc đáo và thú vị cho du khách.\n\nTừ Hà Nội, có thể di chuyển đến Hải Phòng bằng cao tốc (1,5 tiếng), tàu hỏa (100.000-130.000 đồng), xe khách (120.000-250.000 đồng) hoặc xe limousine (230.000-250.000 đồng). Từ TP HCM, có thể bay đến Hà Nội và di chuyển đường bộ đến Hải Phòng.\n\nLưu trú tại Hải Phòng có nhiều lựa chọn từ cao cấp đến bình dân. Các khách sạn sang trọng như Hotel Nikko, Mercure Hai Phong và Vinpearl Hotel Imperia có giá từ 1,2 triệu đến 2,5 triệu đồng một đêm. Còn có các lựa chọn bình dân như homestay và khu nhà liền kề.\n\n\"Khám phá Hải Phòng\" là một trải nghiệm thú vị với nhiều địa điểm hấp dẫn. Dưới đây là một số điểm đến nổi bật:\n\n- Nhà ga Hà Nội - Hải Phòng: Một trong những nhà ga xe lửa đẹp nhất do người Pháp xây dựng.\n- Nhà hát thành phố Hải Phòng: Một biểu tượng du lịch của thành phố, được xây dựng vào năm 1904 và là nơi sinh hoạt chính trị, văn hóa của người Pháp và người bản xứ giàu có.\n- Cầu Bính, Cầu Hoàng Văn Thụ và Cầu Quay xe lửa: Các cây cầu đẹp và độc đáo bắc qua sông Cấm và sông Tam Bạc.\n- Hồ nước ở Hải Phòng: Một hồ nước xanh lạ mắt và bao bọc bởi núi đá vôi.\n- Đồ Sơn: Một khu du lịch nổi tiếng với các khu vui chơi và tham quan như Đồi Rồng, Hòn Dấu và casino.\n- Cát Bà: Một \"viên ngọc\" của du lịch Hải Phòng với các vịnh, đảo Khỉ và ăn hải sản.\n\nTất cả những địa điểm này đều mang lại cho du khách một trải nghiệm thú vị và đáng nhớ khi đến với Hải Phòng.\n\nHải Phòng nổi tiếng với ẩm thực đường phố đa dạng. Du khách có thể tham gia food tour để thưởng thức các món ngon như bánh bèo, bánh đa cua, bánh mì cay, dừa dầm, bún cá cay, ốc, trà cúc, sủi dìn và bánh đúc tàu.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "33",
            "Nighttime temperature (°C)": "28",
            "Precipitation (mm)": "247",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Hà Nội",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "0",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "0"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 1,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 1
        },
        "description": "Thời gian lý tưởng để du lịch Hà Nội là từ tháng 8 đến tháng 11 (mùa thu) và tháng 3 đến tháng 4 (mùa xuân). Mùa thu mang bầu trời xanh trong, gió se lạnh và lá vàng rơi, trong khi mùa xuân mang đến tiết trời ấm áp và hoa nở rộ.\n\nHà Nội có nhiều phương tiện di chuyển đến và trong thành phố, bao gồm máy bay, tàu hỏa, xe khách, ôtô riêng, xe máy và xe đạp. Để trải nghiệm thành phố, bạn có thể đi xích lô, tour môtô ba bánh, xe buýt hai tầng hoặc đi xe máy.\n\nHà Nội cung cấp nhiều lựa chọn lưu trú cho du khách, từ bình dân đến cao cấp. Bạn có thể thuê phòng dorm giá 100.000 đồng một đêm hoặc khách sạn cao cấp giá 3.000.000 - 5.000.000 đồng một đêm. Một số khách sạn nổi tiếng bao gồm Sofitel Legend Metropole Hà Nội, Hilton Hanoi Opera và Sheraton Hà Nội.\n\nKhám phá Hà Nội là một trải nghiệm tuyệt vời với nhiều điểm đến thú vị. Một số điểm đến nổi bật bao gồm:\n\n- Hoàng thành Thăng Long: Di sản văn hóa thế giới với lịch sử hơn 1300 năm.\n- Hồ Hoàn Kiếm: Hồ nước ngọt tự nhiên với nhiều điểm tham quan như đền Ngọc Sơn và phố cổ.\n- Cầu Long Biên: Cầu bắc qua sông Hồng với lịch sử hơn 120 năm.\n- Chùa Trấn Quốc: Ngôi chùa cổ nhất ở Hà Nội với lịch sử 1.500 năm.\n- Văn Miếu: Trường đại học đầu tiên của Việt Nam với lịch sử hơn 900 năm.\n- Lăng Chủ tịch Hồ Chí Minh: Điểm đến quan trọng để bày tỏ lòng thành kính.\n- Phố cổ Hà Nội: Một trong những điểm đến không thể bỏ qua với lịch sử hơn 1.000 năm.\n- Bảo tàng Dân tộc học: Bảo tàng với 15.000 hiện vật và 42.000 phim tư liệu về 54 dân tộc Việt Nam.\n- Các show diễn nghệ thuật đậm bản sắc dân tộc tại Hà Nội như múa rối nước, ca trù, show thực cảnh.\n- Chèo SUP trên hồ Tây: Trải nghiệm thú vị với thời điểm thích hợp vào buổi sáng hoặc chiều mát.\n- Đài quan sát Lotte: Nơi có thể phóng tầm mắt nhìn ngắm toàn cảnh Thủ đô từ tầng 65.\n- Phố đi bộ: Hàng tuần, phố đi bộ Hồ Gươm mở từ 18h thứ Sáu đến hết Chủ nhật.\n- Phố bia: Một trong những nơi vui chơi về đêm sầm uất bậc nhất ở thủ đô.\n- Chợ: Chợ Đồng Xuân, chợ hoa Quảng Bá và chợ đầu mối Long Biên là những địa chỉ khách Tây rỉ tai nhau phải ghé thăm một lần nếu có dịp đến thủ đô.\n\n\"Quán xá\" ở Hà Nội là nơi để thưởng thức ẩm thực đặc trưng của thành phố. Một số món ăn nổi tiếng bao gồm:\n\n- Phở bò: có hai loại chính là chín và tái\n- Bún chả: món thường được ăn vào bữa trưa\n- Bún thang: món cầu kỳ, tinh tế\n- Chả cá Lã Vọng: món ăn dân dã trở thành tinh hoa ẩm thực Hà Thành\n- Bánh cuốn: món ăn thích hợp cho những ngày hè nóng nực\n- Cà phê trứng: món đặc sản của Hà Nội làm từ trứng đánh bông lên hòa quyện cùng cà phê Việt.\n\nKhi đến Hà Nội, du khách có thể mua các món quà sau làm quà cho người thân và bạn bè:\n\n- Ô mai (phố Hàng Đường): vị chua, cay, mặn, ngọt, giá khoảng 100.000 - 150.000 đồng/kg\n- Bánh cốm (Hàng Than): hương cốm tự nhiên, giá không rõ\n- Trà sen (Tây Hồ): ướp trà sen là nghệ thuật, giá không rõ\n- Lụa Vạn Phúc (làng Vạn Phúc, phố Hàng Gai, Đinh Liệt): mỏng, mềm, bền màu, giá không rõ\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "35",
            "Nighttime temperature (°C)": "28",
            "Precipitation (mm)": "172",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Nghệ An",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "0"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 0,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Nghệ An có bốn mùa rõ rệt. Thời điểm đẹp nhất để đi nghỉ dưỡng và tắm biển là mùa hè (tháng 4-6). Mùa xuân và thu phù hợp cho thăm thú và tham gia lễ hội. Mùa hướng dương từ tháng 12 đến Tết Nguyên đán lý tưởng cho săn hoa.\n\nNghệ An có nhiều phương tiện di chuyển đến Vinh. Du khách có thể đi bằng đường bộ (xe khách, ôtô riêng, xe máy), đường bay (Vietnam Airlines, Bamboo Airways, Vietjet) hoặc tàu hỏa. Thời gian và giá vé có thể thay đổi tùy theo thời điểm và phương tiện.\n\nNghệ An có nhiều cơ sở lưu trú từ 3 đến 5 sao như Vinpearl Cửa Hội, Mường Thanh, Sài Gòn Kim Liên... Giá phòng từ 1.000.000 đến 3.000.000 đồng một đêm. Một số gợi ý tại Cửa Lò và TP Vinh có giá từ 400.000 đồng một đêm.\n\nNghệ An là tỉnh rộng nhất Việt Nam, với nhiều điểm du lịch hấp dẫn. Một số điểm du lịch nổi bật bao gồm:\n\n- Khu di tích Quốc gia đặc biệt Kim Liên\n- Đền Chung Sơn\n- Tượng đài Chủ tịch Hồ Chí Minh\n- Cột mốc số 0 ở thị trấn Tân Kỳ\n- Đền và mộ ông Hoàng Mười\n- Đảo chè Thanh Chương\n- Vườn quốc gia Pù Mát\n- Thị trấn Con Cuông\n- Khu sinh thái Phà Lài\n- Biển Cửa Lò\n- Biển Diên Thành\n- Biển Quỳnh\n- Cánh đồng hoa hướng dương\n- Thung lũng hoa Phủ Quỳ\n\nNhững trải nghiệm nên thử bao gồm:\n\n- Nghe hát ví dặm\n- Tham dự lễ Xăng Khan\n- Tham dự lễ hội đền Thanh Liệt\n- Tham quan các làng nghề như mây tre đan, dệt thổ cẩm, làm nồi đất, sản xuất hương tràm, sản xuất tương, chế biến nước mắm.\n\nNghệ An có nhiều đặc sản nổi tiếng như bánh mướt, cháo canh, mực nhảy nướng, bánh bèo, cháo lươn, giò me, dê Cẩu Đòn, rươi Hưng Châu, gà Thanh Chương, nhút Thanh Chương, nước mắm, tương Nam Đàn, trà dược liệu, cam Vinh, kẹo cu đơ.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "36",
            "Nighttime temperature (°C)": "29",
            "Precipitation (mm)": "124",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Hà Tĩnh",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "0",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Di chuyển đến Hà Tĩnh có thể thực hiện theo các phương tiện sau:\n\n- Đường hàng không: Hạ cánh tại sân bay Vinh, sau đó đi xe buýt khoảng 50 km (120.000 - 150.000 đồng).\n- Đường bộ: Di chuyển dễ dàng trên Quốc lộ 1A, thời gian di chuyển từ Hà Nội là 5 tiếng, từ TP HCM là 20 tiếng.\n- Đường sắt: Tàu Thống Nhất dừng tại ga Hương Phố, khoảng 50 km từ trung tâm thành phố Hà Tĩnh, giá vé từ 300.000 - 1,3 triệu đồng một chiều.\n\nTại Hà Tĩnh, các khu vực tập trung khách du lịch bao gồm biển Xuân Thành, biển Thiên Cầm, trung tâm thành phố và huyện Kỳ Anh. Giá phòng tại các khách sạn lớn dao động từ 500.000 - 2 triệu đồng một đêm, trong khi nhà nghỉ nhỏ có giá từ 150.000 - 300.000 đồng.\n\nHà Tĩnh có nhiều địa điểm du lịch hấp dẫn như:\n\n- Biển Thiên Cầm: bãi biển đẹp nhất miền Trung, thích hợp đến mùa hè.\n- Xuân Thành: bãi biển vắng vẻ, có sân golf và nhà hàng hải sản.\n- Hồ Kẻ Gỗ: hồ nước ngọt nhân tạo lớn nhất Hà Tĩnh, lý tưởng cho cắm trại.\n- Khu lưu niệm Nguyễn Du: nơi thắp hương tưởng niệm đại thi hào Nguyễn Du.\n- Ngã ba Đồng Lộc: di tích quốc gia đặc biệt, nơi có tiểu đội nữ thanh niên xung phong hy sinh.\n- Chùa Hương Tích: ngôi chùa cổ được xây dựng vào thế kỷ XIII.\n- Vườn quốc gia Vũ Quang: nơi sinh sống của hàng nghìn loài động thực vật quý hiếm.\n- Đèo Ngang: thắng cảnh nổi tiếng qua bài thơ \"Qua Đèo Ngang\" của Bà Huyện Thanh Quan.\n- Sông La và Núi Hồng Lĩnh: biểu tượng của Hà Tĩnh, nơi du khách có thể ngắm nhìn khung cảnh thiên nhiên hoang sơ.\n\nẨm thực Hà Tĩnh nổi bật với các món ăn từ cá đục, thịt dê, mực nhảy Vũng Áng và các món đặc sản khác. Các món ăn phổ biến bao gồm:\n\n- Gỏi cá đục với vị ngọt tự nhiên và nước chấm đặc biệt\n- Thịt dê được chế biến thành nhiều món như tái chanh, xào lăn, nướng\n- Mực nhảy Vũng Áng được chế biến thành nhiều món như gỏi, xào, hấp\n- Cháo bánh canh với nước dùng từ xương heo và các gia vị\n- Ram - Bánh mướt với sự kết hợp giữa lớp bánh mướt dẻo và chiếc ram giòn.\n\nĐặc sản làm quà ở Hà Tĩnh bao gồm:\n\n- Kẹo cu đơ: được nấu từ mật mía, đường, mạch nha, gừng, đậu phộng, dẻo và dính, thưởng thức cùng trà xanh.\n- Bưởi Phúc Trạch: có vị ngọt, chua thanh, mùi thơm, tép giòn, mọng nước, mùa thu hoạch từ tháng 8 đến tháng 9.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "36",
            "Nighttime temperature (°C)": "27",
            "Precipitation (mm)": "112",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Đà Nẵng",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "0",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 1,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 1,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 1
        },
        "description": "Đà Nẵng có hai mùa rõ rệt: mùa khô từ tháng 1 đến tháng 7 và mùa mưa từ tháng 8 đến tháng 12. Thời điểm đẹp nhất để du lịch Đà Nẵng là từ đầu tháng 4 đến giữa tháng 9, khi có tiết trời mát mẻ và giá cả dịch vụ bình ổn.\n\nDu khách đến Đà Nẵng có thể di chuyển bằng máy bay, tàu hỏa hoặc tự lái ôtô. Giá vé máy bay từ 1,3-3 triệu đồng, tàu hỏa từ 600.000-1,1 triệu đồng. Tự lái ôtô cần ít nhất một tuần và hai tài xế thay phiên cầm lái.\n\nDu lịch tại Đà Nẵng phát triển nhanh chóng với nhiều lựa chọn lưu trú như khách sạn, homestay, căn hộ và phòng tập thể. Giá phòng dao động từ 500.000 đồng đến 10.000.000 đồng một đêm. Các resort và khách sạn 5 sao nổi tiếng ở Đà Nẵng bao gồm InterContinental và Hyatt Regency.\n\nĐịa điểm đẹp ngoài thành phố Đà Nẵng bao gồm bán đảo Sơn Trà, núi Ngũ Hành Sơn, rạn Nam Ô, đèo Hải Vân. Bán đảo Sơn Trà có cánh rừng nguyên sinh rộng lớn và nhiều bãi tắm đẹp như Tiên Sa, Đá Đen, bãi Bụt. Du khách có thể tham gia nhiều hoạt động hấp dẫn như lặn biển ngắm san hô, câu cá cùng ngư dân, chiêm ngưỡng thành phố từ trực thăng, trên đỉnh Bàn Cờ. Nơi đây cũng là nơi sinh sống của hàng trăm loài động vật, trong đó có voọc chà vá chân nâu được mệnh danh là \"nữ hoàng linh trưởng\" trên bán đảo Sơn Trà.\n\nNgũ Hành Sơn là nơi có nhiều ngôi chùa linh thiêng cùng hệ thống các hang động tự nhiên. Đèo Hải Vân cách trung tâm Đà Nẵng khoảng một giờ chạy xe máy, với chiều dài 21 km và đỉnh cao nhất là 496 m so với mực nước biển. Rạn đá Nam Ô là nơi cư dân đông đúc, chủ yếu hành nghề ngư lưới cụ và nổi tiếng với nghề làm pháo và nước mắm truyền thống.\n\nĐà Nẵng cũng có nhiều điểm tham quan hấp dẫn như cầu Rồng, cầu quay sông Hàn, cầu Trần Thị Lý, cầu tình yêu, tượng cá chép hóa rồng, Cung Văn hóa Thiếu nhi Đà Nẵng, Bảo tàng Nghệ thuật Điêu khắc Chăm, Bảo tàng Mỹ thuật Đà Nẵng, Bảo tàng Phật giáo, Nhà thờ Tourane, Làng bích họa Đà Nẵng, chợ Cồn, chợ Hàn, chợ hải sản và các khu chợ đêm.\n\nTất cả những điểm tham quan này đều mang đến cho du khách những trải nghiệm độc đáo và đáng nhớ.\n\nTrải nghiệm tại Đà Nẵng bao gồm:\n\n- Lên trực thăng ngắm cảnh thành phố và biển\n- Học lướt sóng và chèo SUP tại trường dạy lướt sóng Đà Nẵng\n- Thuyền du lịch sông Hàn để ngắm nhìn trung tâm thành phố về đêm\n- Ăn uống và xem cầu Rồng phun lửa\n- Khám phá thành phố Đà Nẵng về đêm với tiết trời mát mẻ và không quá ồn ào.\n\nĐặc sản Đà Nẵng bao gồm:\n\n- Mì Quảng: món ăn khô với đậu phộng rang, bánh tráng mè nướng, giá từ 15.000 - 40.000 đồng một tô.\n- Bánh tráng thịt heo: món ăn đơn giản với thịt heo, giá từ 50.000 - 200.000 đồng một suất.\n- Bê thui Cầu Mống: thịt bê tái, chín rõ, bì chín, giá từ 350.000 - 380.000 đồng một kg.\n- Gỏi cá Nam Ô: cá tươi ngọt thấm vị trong nước dùng cay, giá khoảng 80.000 đồng một suất.\n- Bánh xèo: món ăn bình dân với nước tương nóng, giá từ 20.000 - 100.000 đồng một phần.\n- Bún mắm: món ăn quen thuộc với người Đà Nẵng, giá từ 15.000 - 30.000 đồng mỗi tô.\n- Bún thịt nướng: món ăn dễ tìm, giá khoảng 15.000 – 30.000 đồng mỗi tô.\n- Mít trộn: món khoái khẩu của nhiều người, giá mỗi đĩa khoảng 20.000 đồng.\n- Ốc hút: món ăn được chế biến theo nhiều vị, giá mỗi phần từ 15.000 đến 30.000 đồng.\n- Sữa chua muối: món ăn vặt mềm, không quá béo, giá 1.000 đồng một hũ.\n\nĐà Nẵng có nhiều đặc sản nổi tiếng như tré ông Chánh, tré bà Đệ, bánh khô mè Cẩm Lệ, rong biển Mỹ Khê, nước mắm Nam Ô, hải sản tươi sống hoặc khô mực, khô cá. Những món này dễ tìm mua và đóng gói hành lý làm quà.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "36",
            "Nighttime temperature (°C)": "27",
            "Precipitation (mm)": "43",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Thanh Hóa",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Thanh Hóa có hai mùa rõ rệt: mùa nóng (tháng 5-10) và mùa lạnh (tháng 11-4). Thời điểm đẹp nhất để du lịch là từ tháng 3 đến tháng 8. Mùa hè thích hợp cho bãi biển, mùa thu mát mẻ, giá cả ổn định hơn.\n\nDi chuyển đến Thanh Hóa có nhiều phương tiện và giá vé khác nhau tùy thuộc vào vị trí xuất phát. Từ Hà Nội, giá vé tàu hỏa dao động từ 140.000 - 280.000 đồng, xe khách từ 150.000 - 200.000 đồng. Từ TP HCM, máy bay là lựa chọn tiện lợi nhất với giá vé khoảng 2-3 triệu đồng.\n\nTại Thanh Hóa, khách sạn trung tâm thành phố có giá từ 600.000 - 1 triệu đồng/đêm. Các khu du lịch biển như Sầm Sơn, Hải Tiến, Bãi Đông có giá cao hơn từ 800.000 - 4 triệu đồng/đêm. Nhà nghỉ bình dân giá từ 300.000 đồng/đêm trở lên.\n\n\"Chơi đâu\" là một câu hỏi phổ biến khi tìm kiếm điểm đến du lịch. Tại Thanh Hóa, có nhiều lựa chọn hấp dẫn như:\n\n- Bãi biển Sầm Sơn: nổi tiếng với bãi cát sạch và cảnh vật hoang sơ.\n- Hải Tiến: có đường biển dài, bãi cát sạch và hạ tầng hiện đại.\n- Bãi Đông: thích hợp để tắm và tham gia các hoạt động vui chơi dưới nước.\n- Hải Hòa: yên bình với bãi biển hoang sơ và nước trong.\n- Vườn quốc gia Bến En: có nhiều hoạt động như chèo thuyền, bơi lội và khám phá hang động.\n- Pù Luông: có thời tiết mát mẻ và cảnh quan thiên nhiên đẹp.\n- Hàm Rồng: có các danh lam thắng cảnh, di tích lịch sử và công trình văn hóa tâm linh.\n- Suối cá thần Cẩm Lương: có hàng nghìn con cá tự nhiên đủ kích thước và màu sắc.\n- Thành nhà Hồ: được xây dựng bởi Hồ Quý Ly từ năm 1397 và được UNESCO công nhận là di sản văn hóa thế giới.\n- Khu di tích Lam Kinh: có kiến trúc phong thủy \"tọa sơn hướng thủy\" và được bao quanh bởi núi và dòng sông.\n- Thái miếu nhà Hậu Lê: thờ cúng 27 vị Hoàng đế thời Lê và có nhiều hiện vật gốc có giá trị.\n\nĐặc sản Thanh Hóa bao gồm:\n\n- Chả tôm: nhân từ tôm bột tươi, thịt ba chỉ, hành khô và bánh phở, ăn kèm dưa góp và nước mắm pha loãng.\n- Bánh khoái Thanh Hóa: làm từ bột tẻ, rau cần, bắp cải, tép đồng tươi, ăn chung với nước mắm và dưa góp.\n- Gỏi cá nhệch: đặc sản của vùng Nga Sơn, cá nhệch được bóp với riềng sả và trộn với thính gạo, ăn kèm chẻo làm từ xương cá.\n- Bánh răng bừa: đặc sản tiến vua, được gói bằng lá dong hoặc lá chuối, ăn kèm nước mắm nguyên chất pha chanh, ớt hoặc tiêu bắc.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "37",
            "Nighttime temperature (°C)": "28",
            "Precipitation (mm)": "129",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Hà Nam",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "0",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 1
        },
        "description": "Hà Nam có khí hậu đồng bằng sông Hồng, nóng ẩm mùa hè và lạnh mùa đông. Nơi đây phù hợp ghé thăm quanh năm, nhưng mùa thu hoặc đông thích hợp nếu không chịu được nóng. Mùa lễ hội từ tháng 1 đến tháng 3, phù hợp tham quan chùa vào Rằm tháng 4.\n\nHà Nam nằm ở phía nam thủ đô Hà Nội, có thủ phủ là thành phố Phủ Lý. Để di chuyển đến Hà Nam, bạn có thể chọn xe khách (80.000 - 90.000 đồng), xe khách giá rẻ (50.000 đồng) hoặc tàu hỏa (60.000 đồng).\n\n\"Khám phá Hà Nam\" là một chuyến đi thú vị để khám phá những điểm du lịch tâm linh và văn hóa đặc sắc của tỉnh Hà Nam. Một số điểm đến nổi bật bao gồm:\n\n- Chùa Bà Đanh: Một ngôi chùa linh thiêng với tượng Bà Đanh (thần Pháp Vũ) và câu thành ngữ \"vắng như chùa Bà Đanh\".\n- Làng Vũ Đại: Nguyên mẫu của làng Vũ Đại trong Chí Phèo, nơi có ngôi nhà ba gian của Bá Kiến.\n- Kẽm Trống: Danh thắng quốc gia với dòng sông Đáy chảy qua hai ngọn núi.\n- Đền Trần Thương: Ngôi đền thờ Trần Hưng Đạo và tổ chức lễ phát lương vào tháng Giêng.\n- Chùa Tam Chúc: Ngôi chùa lớn nhất Việt Nam với nhiều điểm tham quan như điện Tam Thế, điện Quán Thế Âm Bồ Tát và điện Pháp Chủ.\n- Làng kho cá Vũ Đại: Nức tiếng bởi công thức cá kho đặc biệt và vị cá đậm đà.\n\nNhững điểm đến này sẽ mang lại cho bạn một trải nghiệm thú vị và đáng nhớ về tỉnh Hà Nam.\n\nĐặc sản Hà Nam bao gồm:\n\n- Bánh cuốn Phủ Lý: làm từ gạo tẻ tám xoan, tráng trên nồi hấp, có hành phi vàng ươm và mỡ, ăn kèm nước chấm mắm chua ngọt và dưa góp.\n- Bún cá rô: nổi tiếng bởi hương vị nước dùng ninh từ xương cá rô ngon ngọt, ăn kèm với rau cải và rau thơm.\n- Cá kho Vũ Đại: được mệnh danh là món đặc sản Hà Nam nổi tiếng nhất, được chế biến cầu kỳ và có vị đậm, cay ngọt.\n- Mắm cáy Bình Lục: có màu cánh gián đẹp, vị thơm bùi của giềng, vị mặn mòi của muối và vị cay nóng của gừng.\n- Cơm rượu làng Vọc: được nấu bằng loại gạo đặc sản ngon và men ta, có vị thơm và không khô hoặc nhão quá.\n- Chuối ngự Đại Hoàng: còn được dân gian gọi là chuối \"tiến vua\" do vỏ ngoài màu vàng, cuống xanh tươi và quả đều tăm tắp.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "35",
            "Nighttime temperature (°C)": "28",
            "Precipitation (mm)": "172",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "An Giang",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "1",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "An Giang có mùa đẹp khác nhau tùy theo thời điểm:\n\n- Từ tháng 3 đến tháng 5: Mùa nắng khô ráo.\n- Tháng 10 và 11: Ngắm thảm bèo và thế giới tự nhiên xanh mát ở rừng tràm Trà Sư.\n- Cuối tháng 11 đến đầu tháng 12: Chiêm ngưỡng cánh đồng lúa chín ở Tà Pạ.\n- Tháng 4 và 8 âm lịch: Diễn ra hai lễ hội lớn.\n- Tháng 7-8: Mưa nhiều, nên mang ô và trang phục phù hợp.\n\nĐể di chuyển đến An Giang, du khách có thể:\n\n- Bằng đường hàng không: Chuyến bay từ Hà Nội, Đà Nẵng, Hải Phòng, Vinh, Đà Lạt, Thanh Hóa đến Cần Thơ (giá từ 1 triệu đồng một chiều) và tiếp tục đi xe khách đến Long Xuyên hoặc Châu Đốc.\n- Bằng xe máy hoặc ôtô: Chạy theo quốc lộ 1 đến ngã 3 An Thái Trung, rẽ phải và qua phà để đến Chợ Mới và núi Sam.\n- Giá thuê xe máy khoảng 100.000 - 150.000 đồng một ngày.\n\nDưới đây là tóm tắt về các điểm tham quan đẹp ở An Giang:\n\n1. **Chợ nổi Long Xuyên**: Nằm gần trung tâm thành phố Long Xuyên, chợ nổi này vẫn còn giữ nguyên nếp sinh hoạt từ xa xưa. Du khách có thể thuê thuyền để khám phá chợ và thưởng thức bữa sáng trên sông.\n\n2. **Rừng tràm**: Đây là một trong những rừng tràm lớn và đẹp nhất miền Tây. Du khách có thể đi thuyền xuyên rừng và thưởng thức vẻ đẹp của thảm thực vật.\n\n3. **Hồ Ô Thum**: Khu hồ nhân tạo này có không gian mát mẻ và bán nhiều đặc sản gà núi nướng lá chúc. Du khách có thể nghỉ chân và dùng bữa trưa tại đây.\n\n4. **Chùa Tây An**: Nằm ở chân núi Sam, chùa Tây An được xây dựng vào năm 1847 và mang dáng dấp của một công trình kiến trúc Ấn Độ. Đây là ngôi cổ tự được Bộ Văn hóa xếp hạng là di tích kiến trúc nghệ thuật cấp quốc gia.\n\n5. **Chợ Châu Đốc**: Chợ này nằm ở trung tâm thành phố Châu Đốc và bán các đặc sản địa phương chế biến ngay tại chỗ. Du khách có thể trải nghiệm cuộc sống của người dân vùng nước nổi.\n\n6. **Hồ Búng Bình Thiên**: Hồ nước ngọt này nằm cặp với sông Bình Di và thuộc huyện An Phú. Du khách có thể tham quan và thưởng thức vẻ đẹp của hồ.\n\n7. **Làng Châu Giang**: Làng này là nơi người Chăm tập trung sinh sống và có các thánh đường Hồi giáo, những ngôi nhà truyền thống và món ăn độc đáo của người địa phương.\n\n8. **Cánh đồng Tà Pạ**: Cánh đồng này như một tấm thảm rộng lớn với những hàng thốt nốt hiên ngang giữa trời xanh.\n\n9. **Thất Sơn**: Đây là 7 ngọn núi tiêu biểu trong 37 ngọn núi ở 2 huyện Tri Tôn và Tịnh Biên. Núi Cấm có độ cao 705 m và là ngọn núi cao nhất trong Thất Sơn.\n\nKhách sạn và homestay ở An Giang tập trung ở núi Sam, khu chợ Châu Đốc và Long Xuyên. Khu vực núi Sam có giá cao, chủ yếu dành cho khách hành hương. Khu chợ Châu Đốc được khuyến nghị cho du khách để tiện tham quan và vui chơi.\n\nĐến An Giang, du khách nên thử các đặc sản địa phương như:\n\n- Bún cá Châu Đốc\n- Cháo bò Tri Tôn\n- Gà nướng lá chúc Ô Thum\n- Cơm tấm Long Xuyên\n- Bánh bò thốt nốt\n- Xôi Xiêm\n- Gỏi sầu đâu\n- Cơm nị cà púa của người Chăm\n- Rau đồng (bông súng, bông điên điển, hẹ nước, rau nhút)\n- Cá linh (nhúng giấm hoặc làm mắm)\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "35",
            "Nighttime temperature (°C)": "26",
            "Precipitation (mm)": "81",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Cao Bằng",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Cao Bằng đẹp vào các mùa sau:\n\n- Mùa đẹp nhất: tháng 8-9, thác Bản Giốc đổ nước nhiều và trong xanh, ruộng bậc thang chín vàng.\n- Mùa mưa: tháng 6-9, nước tuôn trào, tung bọt trắng xóa.\n- Mùa khô: tháng 10-5, trời lạnh, nước chảy êm đềm, trong xanh.\n- Mùa hoa lê: tháng 3.\n- Mùa dã quỳ/tam giác mạch: tháng 11-12.\n\nDi chuyển từ Hà Nội đến Cao Bằng khoảng 280 km, mất 6-7 tiếng. Có thể thuê xe máy với giá 200.000 đồng/ngày. Nếu đi ôtô riêng, có thể chọn cao tốc Hà Nội - Lạng Sơn hoặc cao tốc Hà Nội - Thái Nguyên - Bắc Kạn - Cao Bằng.\n\nTại khu vực thác Bản Giốc, khách có thể nghỉ ở các homestay như Yến Nhi, Khuổi Ky, Lan's Homestay với giá khoảng 200.000 đồng một đêm. Tại trung tâm thành phố Cao Bằng, có các lựa chọn như Primrosé Homestay, Son Tung Hotel với giá trung bình 300.000 đồng một đêm.\n\nDưới đây là tóm tắt về lịch trình 3 ngày 2 đêm du lịch Cao Bằng:\n\n- Ngày 1: \n + Ghé thăm khu di tích Pác Bó (4 tiếng)\n + Tham quan suối Lê Nin, núi Các Mác và hang Cốc Bó\n + Đến cột mốc 108 và khu tưởng niệm anh hùng liệt sĩ Kim Đồng\n\n- Ngày 2: \n + Thăm thác Bản Giốc vào sáng sớm\n + Lên đèo Mã Phục và ngắm cảnh\n + Ghé thăm làng đá cổ Khuổi Ky và động Ngườm Ngao\n + Khám phá hang Ngườm Pục\n\n- Ngày 3: \n + Thăm hồ Thang Hen và núi Mắt Thần\n + Ghé thăm chợ phiên Bảo Lạc\n + Thăm Bản Giuồng và lễ hội Nàng Hai\n + Khám phá thung lũng Xuân Trường và vườn hạt dẻ ở huyện Trùng Khánh\n + Thăm hồ Bản Viết và các hoạt động dã ngoại, cắm trại, trekking, chèo SUP...\n\nĐặc sản Cao Bằng bao gồm:\n\n- Vịt quay, phở thịt quay\n- Ong non xào măng, khâu nhục, gà, giò lợn hầm hạt dẻ\n- Xôi ngũ sắc, bánh cuốn\n- Phở chua với thịt ba chỉ rán giòn, gan lợn, dạ dày lợn, thịt vịt quay\n- Cá trầm hương nướng\n- Bánh áp chao (bánh vịt chao)\n- Bún khô 8 màu\n- Rau dạ hiến (rau bò khai)\n- Hạt dẻ Trùng Khánh\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "33",
            "Nighttime temperature (°C)": "24",
            "Precipitation (mm)": "272",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Nam Định",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 0,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Nam Định có bốn mùa rõ rệt. Thời điểm đẹp nhất để ghé thăm là vào rằm tháng Giêng, khi diễn ra lễ hội Khai Ấn Đền Trần, thu hút hàng chục nghìn du khách tham quan trước và trong đêm lễ chính.\n\nDi chuyển từ Hà Nội đến Nam Định có thể thực hiện bằng đường bộ và sắt. Đường sắt có 3-4 chuyến tàu mỗi ngày, giá vé 90.000 đồng một chiều. Đường bộ mất khoảng 2-2,5 tiếng, vé xe khách từ 60.000 đồng một người.\n\n\"Chơi gì\" tại Nam Định là một câu hỏi thú vị. Thành phố Nam Định có nhiều địa điểm du lịch hấp dẫn như:\n\n- Đền Trần: thờ cúng các vua Trần và quan lại có công phù tá\n- Chùa Phổ Minh: công trình kiến trúc duy nhất thuộc Hành cung Thiên Trường xưa còn tồn tại\n- Phủ Dầy: hội Phủ Dầy được tổ chức hàng năm vào ngày 3/3 âm lịch\n- Chợ Viềng: phiên chợ họp đầu năm vào đêm mùng 7 và ngày mùng 8 âm lịch\n- Bảo tàng Dệt Nam Định: tìm hiểu về cuộc sống của công nhân nhà máy Dệt thời kỳ kháng chiến chống Pháp\n- Làng cây cảnh Vị Khê: làng có lịch sử hơn 700 năm và được gọi là \"làng tỷ phú\"\n- Bảo tàng Đồng quê đầu tiên ở Việt Nam: tái hiện hình ảnh cuộc sống lao động, sinh hoạt của người dân vùng đồng bằng bắc bộ\n- Các nhà thờ nổi tiếng và thực hiện các bộ ảnh theo phong cách châu Âu\n- Bãi biển Hải Thịnh (biển Thịnh Long) và Quất Lâm vào mùa hè.\n\nKhách sạn ở Nam Định đa dạng từ trung tâm thành phố (Vị Hoàng) đến ngoại ô (Nam Cường) và homestay (Ecohost). Thành phố cũng có nhiều khách sạn bình dân, rẻ và đẹp, đáp ứng nhu cầu đa dạng của du khách.\n\nNam Định nổi tiếng với nhiều món ăn đường phố ngon và đặc trưng. Một số món ăn nổi bật bao gồm:\n\n- Phở bò: Làng nghề làm bánh phở lâu năm ở làng Giao Cù.\n- Phở xíu: Món thịt xá xíu được tẩm ướp và rán, ăn kèm với phở bò.\n- Xôi xíu: Món ăn đường phố được bày bán tại các khu chợ và hàng quán vỉa hè.\n- Bánh mì cầu Đò Quan: Bánh mì vỏ giòn, nhân pate, ruốc.\n- Bánh xíu páo: Bánh giản dị, trông qua giống bánh bao chiên nhưng nhân như bánh nướng.\n- Nem nắm Giao Thủy: Món nem ngon được làm từ thịt lợn, bì lợn, thính và nước mắm.\n- Bánh cuốn làng Kênh: Bánh cuốn được làm từ gạo dẻo và bột dong.\n- Xôi cá rô: Món quà sáng dân dã kết hợp hài hòa của cá rô đồng và gạo nếp.\n- Bánh nhãn Hải Hậu: Món ăn chơi, ăn vặt phổ biến được làm từ bột nếp, trứng gà, đường và mỡ lợn.\n- Bún tóp mỡ, bún đũa, phở xíu, bánh bèo và bánh cuốn tại chợ Ngõ Ngang.\n- Nem ốc móng tay ở Giao Thủy.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "35",
            "Nighttime temperature (°C)": "28",
            "Precipitation (mm)": "172",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Bình Phước",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Trung tâm Bình Phước là thành phố Đồng Xoài, cách TP HCM khoảng 120 km. Để di chuyển đến Bình Phước, bạn có thể lựa chọn xe khách hoặc ôtô cá nhân. Giá vé xe khách từ 100.000 đến 180.000 đồng, thời gian chạy khoảng 3-4 tiếng.\n\nTại Bình Phước, có nhiều lựa chọn lưu trú với giá đa dạng. Khách sạn cao cấp có giá từ 550.000 đến 3,4 triệu đồng một đêm. Còn các nhà nghỉ hoặc khách sạn 1-2 sao có giá từ 150.000 đến 500.000 đồng một đêm. Hoặc có thể chọn lưu trú giữa rừng với giá 100.000 đồng một đêm.\n\nBình Phước là một tỉnh có nhiều điểm du lịch hấp dẫn, bao gồm:\n\n- Vườn quốc gia Bù Gia Mập: nơi có thác Đắk Mai, hồ Hoa Mai và nhiều loài động thực vật quý hiếm.\n- Núi Bà Rá: ngọn núi cao thứ ba ở Nam bộ, có khung cảnh đẹp và không khí trong lành.\n- Rừng cao su: nơi có nhiều cây cao su được trồng xen lẫn giữa các rừng cây non và già.\n- Chùa Sóc Lớn: ngôi chùa Khmer lâu đời nhất ở Bình Phước, được xây dựng từ năm 1931.\n- Sóc Bom Bo: nơi có nhịp chày giã gạo của người dân S’tiêng, đã đi vào thơ ca và lịch sử.\n- Căn cứ Tà Thiết: di tích lịch sử quốc gia, nơi tập kết quân lớn nhất từ miền Bắc vào Nam.\n- Lâm viên Mỹ Lệ: nơi có không gian giao thoa giữa núi đồi và ao hồ, thuận lợi về đường giao thông.\n- Trảng cỏ Bù Lạch: nơi có đồng cỏ xanh mướt pha lẫn với màu tím hoa sim.\n- Thủy điện Cần Đơn: công trình thủy điện có lòng hồ lớn và cảnh quan rừng ngập nước đẹp.\n- Đảo Yến Sơn Hà: khu du lịch sinh thái có diện tích khoảng 10 ha, được phủ một lớp xanh của rừng cây.\n- Thác Voi: thác có độ cao khoảng 15 m, được ví như nàng tiên xõa mái tóc dài.\n- Thác Đắk Mai: thác có chiều rộng khoảng 50 m và chiều cao 12 m.\n- Thác Đứng: thác có độ cao chừng 5-6m, rộng khoảng 10 m nhưng lại có một dòng chảy nhanh, mạnh.\n- Chùa Quang Minh: ngôi chùa được khởi công xây dựng từ khoảng năm 1950 và được trùng tu lại vào năm 1990.\n\nBình Phước là nơi đa dạng về ẩm thực, kết hợp nhiều loại nguyên liệu và thể hiện tính đoàn kết cộng đồng. Một số món ăn đặc trưng bao gồm:\n\n- Thịt lợn nướng S'tiêng\n- Gỏi hạt điều\n- Cơm lam\n- Cá lăng nướng\n- Ve sầu sữa chiên giòn\n\nMón ăn này thể hiện sự tổng hòa của nhiều hương vị từ thiên nhiên.\n\nBình Phước nổi tiếng với các đặc sản như hạt điều, cà phê và quýt đường Tân Thành. Hạt điều là thủ phủ trồng hạt điều lớn nhất, cà phê có hương vị đậm đà và quýt đường có vị ngọt thanh, chua nhẹ. Đây là món quà lý tưởng.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "34",
            "Nighttime temperature (°C)": "26",
            "Precipitation (mm)": "228",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Bắc Kạn",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Bắc Kạn cách Hà Nội 165 km. Có hai đường di chuyển: QL3 cũ (3 tiếng) và cao tốc Hà Nội - Thái Nguyên (2 tiếng). Xe khách từ bến Mỹ Đình (Hà Nội) đi tuyến Hà Nội - Bắc Kạn hoặc Cao Bằng, qua điểm du lịch nổi tiếng hồ Ba Bể.\n\nTại Bắc Kạn, du khách có thể lựa chọn lưu trú tại thành phố với các điểm như nhà nghỉ Phúc Anh, khách sạn Phương Nam, Hưng Vân và Nam Hotel. Giá lưu trú dao động từ 200.000 đến 400.000 đồng cho một đêm.\n\nBắc Kạn là một điểm đến du lịch hấp dẫn với nhiều địa điểm thú vị. Một số điểm nổi bật bao gồm:\n\n- Hồ Ba Bể: hồ nước ngọt tự nhiên lớn nhất Việt Nam, thuộc Vườn Quốc gia Ba Bể.\n- Thành phố Bắc Kạn: nơi kết nối các tour tuyến với các huyện giàu tiềm năng du lịch.\n- Sam Chiêm: ngọn đồi xanh mát mẻ, thích hợp cho hoạt động ngoài trời và cắm trại.\n- Khu bảo tồn thiên nhiên Kim Hỷ: hệ sinh thái động thực vật phong phú và tài nguyên khoáng sản.\n- Hồ Bản Chang: hồ nước tự nhiên có hình bán nguyệt, cảnh quan yên bình và lãng mạn.\n- Rừng trúc Pù Lầu: nơi được ví như bối cảnh của phim kiếm hiệp.\n- Thẳm Phầy: hang đá vôi có hệ thống sông ngầm và khối thạch nhũ.\n- Đèo Gió: đỉnh đèo có độ cao 800 m, thường xuyên có mây mù bao phủ.\n\nBắc Kạn cũng là một điểm đến lý tưởng cho các hoạt động cắm trại, chèo thuyền, bơi lội, câu cá và tham quan các di tích lịch sử và văn hóa.\n\nBắc Kạn có nhiều món ăn đặc trưng của người Tày và Nùng. Một số món ăn nổi bật bao gồm:\n\n- Bánh coóc mò (hình dạng chóp nhọn, làm từ gạo nếp và đỗ)\n- Khâu nhục (khoai môn vân tím và thịt ba chỉ)\n- Bánh ngải (nếp nương, lá ngải cứu)\n- Lạp xưởng hun khói (thịt lợn bản, gừng đá)\n- Cá nướng, rau sắng, miến dong Na Rì, trám đen, chè shan tuyết.\n\nĐường đi lại có nhiều đoạn đèo dốc ngoằn ngoèo, đòi hỏi lái xe phải giữ an toàn.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "33",
            "Nighttime temperature (°C)": "25",
            "Precipitation (mm)": "338",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Bắc Ninh",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 0,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 1,
            "Thiên nhiên & động vật hoang dã": 0,
            "Mua sắm": 0
        },
        "description": "Bắc Ninh cách Hà Nội khoảng 40 km, mất khoảng một tiếng di chuyển. Đây là điểm đến lý tưởng cho du lịch văn hóa cuối tuần. Người ở xa có thể kết hợp đến Hà Nội và Bắc Ninh trong cùng một chuyến. Phương tiện di chuyển từ Hà Nội khá thuận tiện.\n\nThời điểm đến Bắc Ninh phù hợp là:\n\n- Tháng 1-3: Lễ hội chùa Dâu, hội Lim, đền Đô, khám phá văn hóa và phong tục tập quán.\n- Cuối năm: Cánh đồng hoa cải bên sông Đuống nở vàng rực, thích hợp chụp ảnh.\n\nBắc Ninh là một tỉnh có nhiều di sản văn hóa và lịch sử phong phú. Một số điểm tham quan nổi bật bao gồm:\n\n- Hội Lim: Lễ hội quan họ Bắc Ninh được UNESCO công nhận là di sản văn hóa phi vật thể đại diện của nhân loại.\n- Đình Bảng: Là một trong những ngôi đình đẹp nhất Việt Nam, được xây dựng từ thế kỷ 17.\n- Chùa Tiêu: Là một ngôi chùa cổ với kiến trúc độc đáo và lưu giữ nhiều tài liệu cổ.\n- Chùa Dâu: Là ngôi chùa cổ nhất Việt Nam, nổi bật bởi kiến trúc độc đáo và tháp Hòa Phong.\n- Chùa Phật Tích: Là một ngôi cổ tự nghìn năm với 10 tượng linh thú quỳ chầu độc đáo.\n- Đền Cùng: Là một ngôi đền nổi tiếng với giếng Ngọc và lịch sử thắng trận.\n- Làng Đông Hồ: Là một làng nghề nổi tiếng với tranh in độc đáo.\n- Làng nghề gốm Phù Lãng: Là một làng nghề được công nhận là Di sản văn hóa phi vật thể cấp quốc gia.\n- Khu di tích Lệ Chi Viên: Là một khu di tích lịch sử văn hóa cấp tỉnh với lịch sử và truyền thuyết phong phú.\n\nẨm thực Kinh Bắc nổi bật với các món bánh đặc trưng như bánh phu thê, bánh tẻ làng Chờ, nem Bùi và bánh khúc làng Diềm. Mỗi món bánh đều có hương vị độc đáo và được làm từ nguyên liệu địa phương, như gạo nếp, đỗ xanh, thịt lợn và rau khúc.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "35",
            "Nighttime temperature (°C)": "27",
            "Precipitation (mm)": "231",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Bình Định",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Thời tiết tại Bình Định:\n\n- Nhiệt độ trung bình khoảng 27 độ C, từ 20 độ C (vùng núi) đến 35-36 độ C (vùng biển).\n- Mùa mưa từ tháng 9 đến 12, và từ tháng 5 đến 8 ở khu vực miền núi.\n- Mùa khô từ tháng 1 đến 8, thích hợp cho du lịch.\n\nBình Định có nhiều phương tiện di chuyển:\n\n- Đường hàng không: Sân bay Phù Cát với giá vé từ 2,5 triệu đến 8 triệu đồng.\n- Đường bộ: Quốc lộ 1A, 1D, 19C, bến xe Quy Nhơn.\n- Đường sắt: Tàu Thống Nhất dừng ở ga Diêu Trì.\n- Xe máy, taxi, ôtô, xe điện cho thuê trong thành phố.\n\nBình Định có nhiều lựa chọn lưu trú đa dạng về giá và chất lượng. Các khu resort cao cấp như Anantara Quy Nhon Villas và Avani Quy Nhon resort & spa có giá từ 2-8 triệu đồng một đêm. Khách sạn trong phố giá từ 500.000-1,5 triệu đồng một phòng.\n\nBình Định là một điểm đến nổi tiếng với đường bờ biển dài, nước xanh, cát mịn và nhiều điểm du lịch hấp dẫn. Một số điểm đến nổi bật bao gồm:\n\n- Thị Nại: đầm lớn nhất Bình Định với hệ sinh thái rừng ngập mặn phong phú.\n- Cầu Thị Nại: cầu vượt biển dài nhất Việt Nam trước đây.\n- Eo Gió: nơi có cảnh hoàng hôn đẹp nhất Việt Nam.\n- Bãi Kỳ Co: bãi biển xanh và trong với cảnh quan \"sơn thủy hữu tình\".\n- Cù Lao Xanh: đảo đẹp nhất miền Trung với nước biển xanh và sạch.\n- Hòn Sẹo: hòn đảo đẹp với vô số khối đá lớn nhỏ nằm ngổn ngang trên mặt biển.\n- Đề Gi: bãi biển xanh, cát trắng và sinh vật biển phong phú.\n- Tam Quan: thị trấn với hàng dừa bạt ngàn và các điểm du lịch như gành đá Lộ Diêu, gành đá Hoài Hải, hang Yến, hồ Mỹ Bình.\n- Tháp Bánh Ít: tháp Chăm Pa cổ với nhiều tháp Chăm còn nguyên vẹn.\n- Tháp Cánh Tiên: kinh đô của vương quốc Chăm pa cổ.\n- Tháp Dương Long: tháp Chăm Pa cổ với chiều cao hơn 30 m.\n- Khu dã ngoại Trung Lương: khu dã ngoại với nhiều khu vực như cắm trại, ngủ nhà lều, bãi tắm và chơi các trò dưới biển.\n- Bảo tàng Quang Trung: bảo tàng thờ và tưởng niệm anh hùng áo vải Nguyễn Huệ.\n- Khu du lịch rừng nguyên sinh: khu du lịch với không gian mát mẻ quanh năm.\n- Làng phong: làng phong với ngôi làng là nơi an cư của bệnh nhân phong từ khắp cả nước.\n\nBình Định là thiên đường ẩm thực với nhiều món ngon đặc trưng. Một số món nổi bật bao gồm:\n\n- Bánh hỏi: bánh làm từ bột gạo, lòng heo và rau sống.\n- Bánh xèo tôm nhảy: bánh xèo với tôm đất nhỏ, không sử dụng tôm biển.\n- Bánh ít lá gai: bánh có vỏ đen, nhân đậu xanh, vị dẻo và thơm.\n- Bánh hồng: bánh có hình dạng đơn giản, vị thơm của nếp và độ giòn của dừa.\n- Hải sản: tôm hùm, cua huỳnh đế, các loại ốc tươi ngon.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "35",
            "Nighttime temperature (°C)": "27",
            "Precipitation (mm)": "229",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Quảng Nam",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "1",
            "Hang động": "1",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 1,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 1,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 1
        },
        "description": "Có nhiều phương tiện để đến Quảng Nam, bao gồm:\n\n- Đường hàng không: Sân bay Đà Nẵng hoặc Chu Lai\n- Đường sắt: Các đôi tàu Thống Nhất từ Hà Nội và TP HCM\n- Đường bộ: Xe khách, xe buýt, taxi, xe dịch vụ\n- Đường biển: Cảng Trường Hải ở khu kinh tế mở Chu Lai, tàu cao tốc từ biển Cửa Đại đến Cù Lao Chàm\n\nGiá vé và thời gian di chuyển tùy thuộc vào phương tiện và tuyến đường.\n\nQuảng Nam là địa phương phát triển mạnh về du lịch với nhiều lựa chọn lưu trú. Các resort ven biển như Four Seasons Resort The Nam Hai và Victoria Hoi An Beach Resort & Spa có giá từ 1-100 triệu đồng một đêm. Khách sạn và homestay ở Hội An và Tam Kỳ có giá từ 300.000-1,2 triệu đồng một đêm.\n\nHội An là một trong hai Di sản văn hoá thế giới của tỉnh Quảng Nam, nổi tiếng với giá trị văn hoá và kiến trúc cổ. Ngoài ra, có nhiều điểm du lịch khác như:\n\n- Rừng dừa Bảy Mẫu: khu du lịch sinh thái nổi tiếng với rừng dừa xanh và các hoạt động như múa thúng, đua thuyền.\n- Thánh địa Mỹ Sơn: thánh địa Ấn Độ giáo của Vương quốc Chăm Pa xưa, với 70 công trình đền tháp được chia thành nhiều cụm.\n- Cù Lao Chàm: đảo bảo tồn hệ sinh thái biển với 950 loài thủy sinh, nơi du khách có thể khám phá, đi câu cá, lặn ngắm san hô.\n- Làng bích họa Tam Thanh: làng có khoảng 30 bức tranh sắc màu rực rỡ phủ trên những bức tường cũ.\n- Bãi biển Cửa Đại: bãi biển đẹp với nước xanh trong, cát trắng, thoai thoải, thích hợp để tắm.\n- Hồ Phú Ninh: địa điểm du lịch sinh thái nổi bật với khí hậu mát mẻ, rừng nguyên sinh và hơn 20 đảo lớn.\n- Tượng đài mẹ Thứ: tượng đài tưởng niệm Mẹ Việt Nam Anh hùng Nguyễn Thị Thứ, nơi có quy mô lớn nhất Đông Nam Á.\n- Làng gốm Thanh Hà: nơi bạn có thể ngắm nhìn những sản phẩm gốm mỹ nghệ tinh xảo được làm từ bàn tay của những nghệ nhân xứ Thanh Hà.\n\nẨm thực Quảng Nam nổi tiếng với các món ăn đặc trưng như:\n\n- Bê thui: Món ăn phổ biến ở miền Trung, được làm từ bê 4-5 tháng tuổi, thui trên than lửa và ăn kèm với mắm nêm, rau sống và bánh tráng cuốn.\n- Mì Quảng: Món ăn có nguồn gốc từ Quảng Nam, được làm từ bột gạo xay mịn, tráng thành từng lớp, và ăn kèm với rau sống, thịt lợn, tôm, thịt gà và nước dùng.\n- Cao lầu: Món ăn đặc sản của Hội An, được làm từ sợi mì vàng, dùng cùng tôm, thịt lợn, rau sống và nước dùng.\n- Cơm gà: Món ăn phổ biến ở Tam Kỳ và Hội An, được làm từ cơm dẻo, thơm, thịt gà chắc, ngậy, lòng gà đậm vị và đu đủ bào giòn.\n- Các món phổ biến khác như bánh tráng cuốn thịt heo, bánh canh, bánh mì, bánh bột lọc và nem nướng.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "36",
            "Nighttime temperature (°C)": "27",
            "Precipitation (mm)": "97",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Phú Yên",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 1,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Phú Yên có hai mùa rõ rệt: mùa mưa (tháng 9-12) và mùa nắng (tháng 1-8). Du khách nên đến Phú Yên vào mùa nắng để thuận tiện cho chuyến tham quan. Mùa hè là thời điểm lý tưởng để đắm mình vào biển xanh và săn ảnh.\n\nPhú Yên cách Hà Nội 1.200 km và TP HCM 500 km, có nhiều lựa chọn di chuyển như máy bay, tàu hỏa, ôtô. Giá vé máy bay từ 1,5 triệu đến 5 triệu đồng, tàu hỏa từ 400.000 đến 1.000.000 đồng, ôtô giường nằm 540.000 đồng.\n\nPhú Yên và Tuy Hòa có ít resort và khách sạn cao cấp. Giá phòng trung bình trong thành phố là 150.000 - 300.000 đồng/đêm. Các khu nghỉ sang trọng như Rosa Alba Resort và Sala Grand Tuy Hoa Hotel có giá từ 700.000 - 5.000.000 đồng/đêm.\n\n\"Chơi đâu\" là một trong những điểm du lịch nổi tiếng của Phú Yên, Việt Nam. Bạn có thể tham quan các điểm du lịch trong 4 ngày, hoặc 2 ngày nếu không dư dả thời gian. Dưới đây là một số điểm du lịch nổi bật:\n\n- Gành Đá Đĩa: Một tổ ong khổng lồ với những khối trụ vuông vức xếp liền nhau vươn mình ra biển.\n- Ngọn hải đăng Gành Đèn: Có độ cao 22 m so với mực nước biển, phát nguồn sáng cho tàu thuyền ra, vào vịnh Xuân Đài.\n- Bãi Xép: Nơi bạn có thể đứng chênh vênh trên vách núi cao và ngắm nhìn màu biển xanh ngọc bích bên dưới.\n- Đại Lãnh: Có những triền cát rất đẹp và là nơi nhìn thấy bình minh sớm nhất ở Việt Nam.\n- Bãi rêu Xóm Rớ: Với những tảng đá bê tông thô kệch nằm chìm dưới nước biển nay mọc lên từng đám rêu xanh đã hút hồn du khách.\n- Tháp đôi Nghinh Phong: Là biểu tượng của du lịch Phú Yên và truyền thuyết \"Con Rồng Cháu Tiên\".\n- Hòn Yến: Điểm check-in yêu thích không chỉ của khách du lịch mà cả giới nhiếp ảnh nhờ có những rạn san hô trên cạn nhiều màu sắc và hình thù.\n- Nhất Tự Sơn: Một trong những hòn đảo đẹp nhất của vịnh Xuân Đài, thuộc địa bàn xã Xuân Thọ 1, thị xã Sông Cầu.\n- Thác Vực Hòm: Là thác nước nằm giữa những cột đá bazan được thiên nhiên tạo thành theo cách tương tự như Gành Đá Đĩa của Phú Yên.\n- Hồ Trần Phú: Là một điểm hẹn \"hot\" cho các bạn trẻ chụp ảnh check-in, ngắm cảnh, hoặc đơn thuần là dạo chơi hóng gió.\n- Vân Hòa: Là một cao nguyên đất đỏ bazan màu mỡ, được ví như \"Đà Lạt của Phú Yên\" nhờ nằm ở độ cao 400 m, khi hậu mát mẻ, nhiều nắng gió và thường có mây mờ sương giăng.\n\n'Lịch trình gợi ý' cho 4 ngày du lịch tại Cà Mau bao gồm:\n\n- Ngày 1: Tháp Nhạn, bãi Long Thuỷ, Bãi Xép\n- Ngày 2: Gành Đá Đĩa, hải đăng Gành Đèn, đầm Ô Loan, hải đăng Đại Lãnh – Mũi Điện, Bãi Môn\n- Ngày 3: Đại Lãnh, Vũng Rô, đảo Điệp Sơn\n- Ngày 4: Nhà thờ Măng Lăng, cầu gỗ Tuy An, bãi rêu Xóm Rớ\n\nĐặc sản Phú Yên bao gồm:\n\n- Cá ngừ: mắt cá ngừ tiềm thuốc bắc, gỏi bao tử cá ngừ, cá ngừ cuốn cải xanh\n- Sò huyết: hấp, nướng tái, xào me, rang muối ớt\n- Cơm gà: dai giòn, ít mỡ, vàng ươm và ngọt\n- Cá nục: hấp, ăn kèm bánh tráng, rau sống và nước chấm chua cay\n- Cháo hàu: xào hàu với hành, muối tiêu, ninh chung với gạo đỏ, gạo nếp\n- Bánh canh hẹ: sợi mềm dai, ăn cùng chả cá biển\n- Bò một nắng: thịt đùi và thăn bò tươi, nướng chín trên than hoa\n- Chả dông: thịt dông có sẵn vào mùa hè, ăn kèm rau sống\n- Bánh bèo: vị thơm và dẻo đặc biệt, ăn kèm bánh mì chiên giòn, chà bông và mỡ hành\n- Bánh hỏi lòng heo: ăn kèm bánh tráng cuốn, rau sống, chấm cùng nước mắm tỏi ớt\n- Bánh xèo tôm nhảy: đúc bằng khuôn nhỏ, ăn kèm bánh tráng và rau\n- Hải sản: quán vỉa hè ở 43 Trần Quý Cáp bán đa dạng hải sản như sò lông nướng mỡ hẹ, ốc hương nấu lá dứa, sò huyết, sò điệp, ốc móng tay, ốc bươu, ốc hút...\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "34",
            "Nighttime temperature (°C)": "27",
            "Precipitation (mm)": "75",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Lào Cai",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "1",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 1
        },
        "description": "Lào Cai cách Hà Nội khoảng 300 km và có thể di chuyển bằng đường bộ, tàu hỏa hoặc máy bay. \n\n- Đường bộ: Sử dụng cao tốc Hà Nội - Lào Cai (CT05), thời gian di chuyển khoảng 3,5 - 4 tiếng.\n- Tàu hỏa: Chạy hàng ngày từ Hà Nội tới Lào Cai (SP4), giá vé 280.000 đồng một lượt.\n- Xe khách: Có thể đi từ các tỉnh thành khác tới Hà Nội, sau đó di chuyển tiếp tới Lào Cai.\n- Bay: Du khách có thể bay từ các tỉnh thành khác tới Hà Nội, sau đó di chuyển tiếp tới Lào Cai.\n\nThành phố Lào Cai có nhiều điểm du lịch nổi tiếng như đền Thượng, đền Cấm, đền Quan, chùa Cam Lộ, cửa khẩu quốc tế Hà Khẩu, Cầu Cốc Lếu, chợ Cốc Lếu. Thị xã Sa Pa có khí hậu mát mẻ, phù hợp cho du lịch hè.\n\nTP Lào Cai có mạng lưới khách sạn đa dạng từ bình dân đến cao cấp. Giá phòng đôi dao động từ 200.000-1.000.000 đồng một đêm. Ở Y Tý và Bắc Hà, chủ yếu là homestay, nhà sàn và khách sạn nhỏ với giá phòng đôi khoảng 500.000 đồng một đêm.\n\nẨm thực Bắc Hà là một phần quan trọng của văn hóa vùng cao này. Các món ăn đặc trưng bao gồm:\n\n- Phở hồng: làm từ gạo lứt nương hồng, mềm, mịn và không hàn the.\n- Rượu ngô Bản Phố: thức uống mang phong vị núi rừng và được làm từ ngô nếp.\n- Thắng cố: món ăn nổi tiếng của người H'Mông, có tuổi đời gần 200 năm và được biến tấu với đa dạng nguyên liệu.\n- Xôi ngũ sắc: thứ xôi dẻo, thơm và màu sắc bắt mắt với năm màu chủ đạo.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "33",
            "Nighttime temperature (°C)": "22",
            "Precipitation (mm)": "262",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Vĩnh Long",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 1
        },
        "description": "Vĩnh Long cách TP HCM và Cần Thơ khoảng 100 km và 30 km. Du khách có thể di chuyển bằng máy bay, ôtô, xe khách, xe máy, taxi hoặc xe buýt. Giá vé và thời gian di chuyển tùy thuộc vào phương tiện và điểm xuất phát.\n\nKhách sạn ở Vĩnh Long tập trung ở trung tâm thành phố, đa dạng loại phòng từ nhà nghỉ, homestay đến khách sạn 2-3 sao. Các khách sạn được đánh giá cao như Sài Gòn Vĩnh Long, Cửu Long, Vinh Sang, giá phòng từ 400.000 - 1,1 triệu đồng một đêm.\n\nVĩnh Long là một tỉnh miền Tây Nam Bộ có nhiều điểm du lịch hấp dẫn. Dưới đây là một số điểm du lịch nổi bật:\n\n- Khu du lịch sinh thái Vinh Sang: có cảnh quan xanh giống những trang trại trồng cây ăn trái.\n- Khu du lịch Trường Huy: có tổng diện tích 10 ha, là điểm vui chơi, giải trí, nghỉ dưỡng.\n- Khu sinh thái Nhà Xưa: được xây dựng theo kiến trúc nhà ba gian ở miền Tây Nam Bộ xưa.\n- Khu du lịch Hoàng Hảo: mang đặc trưng của miền Tây Nam Bộ, có ruộng đồng, hồ sen và nhiều tiểu cảnh.\n- Chùa Phước Hậu: là điểm du lịch tâm linh không thể bỏ qua ở Vĩnh Long.\n- Chùa Phật Ngọc Xá Lợi: có kiến trúc đậm bản sắc văn hóa Phật giáo người Việt.\n- Bảo tàng: có nhiều cây cổ thụ đã được công nhận \"Cây di tích lịch sử văn hóa Việt Nam\".\n- Làng nghề gốm truyền thống: có nhiều ngôi nhà được xây từ gốm.\n- Làng nghề gạch gốm Mang Thít: là một \"Vương quốc lò gạch\" với nghề sản xuất gạch gốm lâu đời.\n- Khu lưu niệm cố thủ tướng Võ Văn Kiệt: có không gian mở, gần gũi, thể hiện sự thành kính.\n- Chợ nổi Trà Ôn: là một nét văn hóa truyền thống của miền Tây, thu hút đông đảo người dân trong nước cũng như quốc tế.\n- Cù lao An Bình: là một trong những điểm chuyên cung cấp đủ loại trái cây, hoa quả tươi đến các huyện và thành phố Vĩnh Long.\n\nĂn uống ở Vĩnh Long đa dạng và phong phú, kết hợp nhiều loại nguyên liệu. Một số món ăn đặc trưng bao gồm:\n\n- Cá cháy kho: kho chung với mía, tạo hương vị độc đáo\n- Mắm và khoai: kết hợp vị ngọt, mặn và thơm\n- Cá kèo nướng ống sậy: nướng trên bếp than hồng, có màu vàng, thịt mềm ngọt\n- Bánh tráng nem: làm bằng bột gạo, không phụ gia, mềm dẻo, vị mặn nhẹ.\n\nVĩnh Long nổi tiếng với các đặc sản nhiệt đới như thanh trà và bưởi Năm Roi. Thanh trà có hai loại chua và ngọt, giá khoảng 50.000 đồng/kg. Bưởi Năm Roi Vĩnh Long được trồng ở xã Mỹ Hòa, thị xã Bình Minh, nổi tiếng về độ ngon và ngọt.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "33",
            "Nighttime temperature (°C)": "25",
            "Precipitation (mm)": "191",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Điện Biên",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Sân bay Điện Biên đã mở cửa trở lại vào ngày 2/12/2023. Có hai đường bay thẳng từ Hà Nội và TP HCM đến Điện Biên. Đường bộ từ Hà Nội đến Điện Biên dài 450 km, mất khoảng 10 tiếng. Xe khách chạy tuyến Hà Nội - Điện Biên với giá vé từ 300.000 đến 350.000 đồng.\n\nKhách sạn ở Điện Biên tập trung ở thành phố Điện Biên Phủ, đa dạng loại phòng từ nhà nghỉ, homestay đến khách sạn 3-4 sao. Giá phòng từ 150.000 đến 1,2 triệu đồng một đêm. Một số gợi ý gồm: Mường Thanh, Him Lam Hotel, homestay Mường Then, Phương Đức.\n\nCụm di tích chiến thắng Điện Biên Phủ là một trong những điểm đến lịch sử quan trọng tại tỉnh Điện Biên. Các điểm đến bao gồm:\n\n- Đồi A1: Một trong những cứ điểm quan trọng của trận đánh, có căn hầm cố thủ và dấu tích hố bộc phá.\n- Hầm chỉ huy của tướng Đờ Cát: Một công trình kỳ công được xây dựng để bảo vệ khu trung tâm.\n- Bảo tàng Chiến thắng Điện Biên Phủ: Một công trình mang ý nghĩa lớn về lịch sử, văn hóa và nghệ thuật.\n- Tượng đài chiến thắng: Một công trình tọa lạc trên đồi D1, với cụm tượng đồng cao, to và nặng nhất Việt Nam.\n- Nghĩa trang: Nơi an nghỉ của 644 cán bộ, chiến sĩ hy sinh trong chiến dịch Điện Biên Phủ.\n- Sở Chỉ huy Chiến dịch Điện Biên Phủ: Một công trình được bố trí thành một hệ thống liên hoàn để bảo vệ khu trung tâm.\n- Đèo Pha Đin: Một điểm cao nhất của tỉnh Điện Biên, nơi bắt đầu của hành trình kéo pháo, vận tải lương thực vũ khí đạn dược bằng sức người của quân dân Việt Nam.\n- Cánh đồng Mường Thanh: Một cánh đồng lớn với diện tích hơn 20 km2, được ví như một \"cái kho\" khổng lồ chứa đầy ngô lúa.\n- Mường Nhé: Một huyện ở phía tây bắc tỉnh Điện Biên, nơi có điểm cực Tây của Việt Nam.\n- A Pa Chải: Một điểm đến nổi tiếng nhất ở Mường Nhé, nơi có cột mốc tọa độ số 0.\n- Thị xã Mường Lay: Một thủ phủ người Thái Trắng, nơi du khách có thể du ngoạn trên sông Đà và tìm hiểu cuộc sống và văn hóa của đồng bào Thái.\n- Cầu Hang Tôm: Một cây cầu dây văng lớn nhất Đông Dương lúc bấy giờ.\n- Điện Biên Đông: Một huyện phía đông nam tỉnh Điện Biên, với nhiều đỉnh núi cao, thích hợp cho các chuyến trekking leo núi.\n- Suối nước nóng U Va: Một điểm đến lý tưởng để thư giãn tinh thần, cơ thể thoải mái và da dẻ mịn màng.\n- Thành Bản Phủ: Một di tích lịch sử văn hóa cấp quốc gia, ghi dấu nhiều những hoạt động nổi bật cho người anh hùng Hoàng Công Chất.\n\nDưới đây là tóm tắt về ẩm thực vùng núi Tây Bắc, đặc biệt là Điện Biên:\n\n- Mắc khén là gia vị đặc trưng ở vùng núi Tây Bắc, dùng để tạo sự khác biệt cho món gà nướng.\n- Pa pỉnh tộp là món cá nướng với gia vị mắc khén và mầm măng của cây sa nhân.\n- Vịt om hoa chuối là món ăn dân dã, dễ chế biến với thịt vịt đồng và hoa chuối rừng.\n- Lợn xay nhuyễn gói trong lá chuối, chưng cách thủy là món ăn đơn giản nhưng ngon.\n- Rêu đá là món ăn đặc trưng của người Thái, được nướng trên than hoa.\n- Chẩm chéo là gia vị cổ truyền của dân tộc Thái, dùng chấm xôi, món luộc, đồ nướng và rau sống.\n\n'Lưu ý': Nên tránh đến Điện Biên vào mùa mưa do nguy cơ sạt lở cao.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "32",
            "Nighttime temperature (°C)": "24",
            "Precipitation (mm)": "370",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Ninh Bình",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Ninh Bình đẹp vào mùa xuân (tháng 1-3) với tiết trời mát mẻ và nhiều lễ hội. Mùa hè (tháng 5-8) là thời điểm lý tưởng để ngắm cánh đồng lúa chín vàng và đầm sen thơm ngát. Đây là hai thời điểm lý tưởng để ghé thăm Ninh Bình.\n\nĐể di chuyển đến Ninh Bình, du khách có thể:\n\n- Bắt xe khách từ Hà Nội (bến xe Giáp Bát) hoặc đặt xe Limousine (2 giờ, 100.000 - 150.000 đồng).\n- Bay từ TP. HCM đến Hà Nội và đi xe khách về Ninh Bình (900.000 - 1,3 triệu đồng/chiều).\n- Đi tàu hỏa từ các tỉnh thành khác (đặt vé trước hoặc mua tại ga).\n- Di chuyển bằng phương tiện cá nhân hoặc thuê xe máy trong thành phố.\n\nDu khách đến Ninh Bình có thể chọn ở tại các homestay hoặc khu nghỉ dưỡng 4-5 sao. Homestay có giá khoảng 200.000 đồng/người/đêm, phù hợp cho cặp đôi, nhóm bạn hoặc du khách một mình. Khu nghỉ dưỡng 4-5 sao có giá từ 1,7-6 triệu đồng/đêm với nhiều tiện nghi.\n\nKhi đến Ninh Bình, bạn không thể bỏ qua các đặc sản như cơm cháy, thịt dê tái chanh, dê xào lăn, dê nướng, cua đồ rang lá lốt, gỏi cá nhệch... Thịt dê ở Ninh Bình được yêu thích vì dai và săn chắc. Các địa chỉ ăn uống gợi ý bao gồm:\n\n- Nhà hàng thịt dê Chính Thư\n- Nhà hàng Đức Dê\n- Nhà hàng Dũng Phố Núi\n- Miến lươn bà Phấn\n- Bún mọc Tố Như\n- Kem xôi Thanh Hằng\n\nGiá thịt dê tùy theo cách chế biến, từ 100.000 - 250.000 đồng/phần.\n\nDưới đây là tóm tắt về các điểm tham quan tại Ninh Bình:\n\n1. **Tràng An**: Giá vé 250.000 đồng/người lớn, 100.000 đồng/trẻ em dưới 1,4 m. Có 3 tuyến du lịch bằng thuyền để tham quan các hang động.\n2. **Tam Cốc – Bích Động**: Giá vé 120.000 đồng/người, phí đi thuyền 150.000 đồng/chuyến.\n3. **Hang Múa**: Giá vé 100.000 đồng/người, leo bộ qua 500 bậc đá để ngắm toàn cảnh Ninh Bình.\n4. **Cố đô Hoa Lư**: Giá vé 20.000 đồng/người, thăm đền vua Đinh và vua Lê.\n5. **Chùa Bái Đính**: Giá vé 20.000 đồng/người, thăm chùa Pháp Chủ và điện Tam Thế.\n6. **Động Am Tiên**: Giá vé 20.000 đồng/người, thăm động và hồ nước xanh mát.\n7. **Đầm Vân Long**: Giá vé 20.000 đồng/người, vé thuyền 60.000 đồng/2 người.\n8. **Vườn Chim Thung Nham**: Giá vé 100.000 đồng/người, vé thuyền 20.000 đồng/người.\n9. **Nhà thờ đá Phát Diệm**: Giá vé miễn phí, thăm nhà thờ lớn và 5 nhà thờ nhỏ.\n10. **Vườn quốc gia Cúc Phương**: Giá vé 20.000 đồng/người, thăm rừng nguyên sinh và các hang động.\n11. **Đồi dứa Tam Điệp**: Giá vé miễn phí, lưu ý không bẻ dứa của người dân.\n\n\"Lịch trình tham khảo\" tại Ninh Bình bao gồm 3 lựa chọn:\n\n- Ngày 1: Khám phá Hang Múa, Tràng An\n- Ngày 2: Chùa Bái Đính, Cố Đô Hoa Lư và Động Am Tiên\n- Hoặc Ngày 1: Tam Cốc, Bích Động và Đồi dứa Tam Điệp\n- Hoặc Ngày 1: Hà Nội - Vườn Quốc gia Cúc Phương và Ngày 2: Nhà thờ đá Phát Diệm và Vườn chim Thung Nham.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "35",
            "Nighttime temperature (°C)": "27",
            "Precipitation (mm)": "108",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Quảng Trị",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "0",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 0
        },
        "description": "Quảng Trị không có sân bay, du khách cần bay tới Quảng Bình hoặc Huế. Từ Huế, có thể đi xe hoặc taxi 1 tiếng 45 phút, từ Quảng Bình mất 2 tiếng. Du khách cũng có thể đi xe khách hoặc tàu Thống Nhất từ Bắc - Nam. Giá vé xe khách từ 400.000 - 800.000 đồng, tàu từ 400.000 - 1,3 triệu đồng.\n\nCác khu lưu trú tại Quảng Trị tập trung ở thành phố Đông Hà, thị xã Quảng Trị và bãi biển Cửa Tùng, Cửa Việt. Giá khách sạn dao động từ 150.000 đồng đến 1,2 triệu đồng một đêm, tùy thuộc vào loại hình và chất lượng.\n\nQuảng Trị là một tỉnh nổi tiếng với nhiều di tích lịch sử và địa điểm du lịch hấp dẫn. Một số điểm đến nổi bật bao gồm:\n\n- Cầu Hiền Lương: Một biểu tượng của sự thống nhất đất nước\n- Thành cổ Quảng Trị: Một di tích lịch sử quan trọng\n- Nghĩa trang liệt sĩ Trường Sơn: Nơi yên nghỉ của hơn 10.200 liệt sĩ\n- Bãi biển Cửa Việt: Một điểm nghỉ mát nổi tiếng\n- Đảo Cồn Cỏ: Một điểm du lịch lịch sử và trải nghiệm\n- Chợ Đông Hà: Một chợ lớn với nhiều hàng hóa\n- Thánh địa La Vang: Một điểm hành hương quan trọng\n- Khe Sanh: Một cứ điểm quan trọng trong chiến tranh\n- Làng cổ Bích La: Một điểm tham quan với nhiều công trình kiến trúc tín ngưỡng\n- Lao Bảo: Một cửa khẩu quan trọng trên biên giới Việt Nam - Lào\n- Sông Đakrông: Một điểm du lịch với cảnh núi non và lịch sử.\n\nẨm thực Quảng Trị là một phần quan trọng của văn hóa địa phương. Một số món ăn đặc trưng bao gồm:\n\n- Cháo vạt giường: được làm từ bột gạo, cá lóc và có hương vị đặc trưng.\n- Bún hến: chế biến từ con chắt chắt, có vị ngọt và đậm đà.\n- Mít luộc: được luộc chín và có độ giòn, ngọt.\n- Lòng sả: chế biến từ tiết vịt hoặc lợn, có mùi sả đặc trưng.\n- Thịt trâu nướng lá trơng: có hương vị lạ và vị cay nhẹ.\n- Bắp ngô: được chế biến từ hạt ngô nếp và có vị ngọt ngào, bùi và thơm.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "36",
            "Nighttime temperature (°C)": "27",
            "Precipitation (mm)": "51",
            "UV Index": "8",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    },
    {
        "city": "Hà Giang",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "0",
            "Thành phố": "1",
            "Làng mạc": "1",
            "Hang động": "0",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 0,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 0,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 1,
            "Thư giãn & chăm sóc sức khỏe": 0,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 1
        },
        "description": "Khí hậu Hà Giang lạnh và ẩm ướt trong năm. Du lịch Hà Giang có thể vào bất kỳ mùa nào. Thời điểm đẹp nhất là:\n\n- Mùa thu (tháng 10-12): Lúa chín vàng, hoa tam giác mạch và cánh đồng cải nở sắc.\n- Mùa xuân (tháng 5-7): Hoa mơ, hoa mận nở trắng rừng và núi rừng xanh mướt.\n\nĐể đến Hà Giang, bạn có thể chọn các phương tiện sau:\n\n- Từ miền Bắc: Có nhiều nhà xe chạy thẳng từ các tỉnh miền Bắc đến Hà Giang.\n- Từ miền Nam hoặc miền Trung: Nên bắt đầu hành trình từ Hà Nội.\n- Từ Hà Nội: Có nhiều xe khách xuất phát từ các bến xe, giá vé 200.000 - 300.000 đồng/lượt.\n- Tại Hà Giang: Có thể thuê xe máy (150.000 - 300.000 đồng/ngày) hoặc ô tô dịch vụ (7 - 16 chỗ).\n\nNhững lựa chọn lưu trú đẹp tại khu vực cao nguyên đá Hà Giang bao gồm:\n\n- P'apiu: biệt thự, villa thiết kế nhà trình tường của người H'Mong, giá 10.000.000 đồng/đêm.\n- H'Mong Village: thiết kế hình quẩy tấu, giá phòng cộng đồng 400.000 đồng/đêm, bungalow 2.400.000 đồng/đêm.\n- Homestay Hoàng Su Phì, Kinh Homestay, Hồ Thầu Eco Village, Chúng Pủa, Bụi homestay, nhà cổ Hoàng Thân, Ong Vàng Mèo Vạc, Lo Lo Ancient House.\n\nDưới đây là tóm tắt hành trình 3 ngày 2 đêm đến Hà Giang:\n\nNgày 1: Hà Nội - Hà Giang - Đồng Văn\n\n- Khởi hành từ Hà Nội tối thứ 6\n- 8h sáng ngày hôm sau lên đường tới Đồng Văn\n- Chụp ảnh ven đường và dừng chân tại cổng trời Quản Bạ\n- Ghé thăm Núi Đôi Cô Tiên và hồ Nặm Đăm\n- Ăn trưa tại thị trấn Yên Minh\n- Đi đến phố cổ Đồng Văn và tham quan Dốc Thẩm Mã\n- Ghé thăm nhà Pao và phố Cáo\n- Đi chợ phiên và mua quà lưu niệm\n\nNgày 2: Đồng Văn - Lũng Cú - sông Nho Quế - đèo Mã Pì Lèng\n\n- 6h30 xuất phát từ Đồng Văn sang Lũng Cú\n- Tham quan cột cờ và ngắm núi rừng\n- Di chuyển ngược lại đường cũ về Đồng Văn\n- Đi đến sông Nho Quế và đi thuyền\n- Len lỏi hết con đường vòng vèo đến bến thuyền\n- Ghé thăm Bảo tàng con đường Hạnh Phúc\n- Di chuyển xuống đèo Mã Pì Lèng và ngắm cảnh\n- Ghé thăm Bảo tàng con đường Hạnh Phúc\n- Dừng chân ở khu vực cột mốc báo 12 km tới Mèo Vạc\n\nNgày 3: đèo Mã Pì Lèng - Làng văn hóa dân tộc Mông - Mèo Vạc - Hà Nội\n\n- Di chuyển từ đèo Mã Pì Lèng xuống thôn Tà Làng\n- Ghé thăm Bảo tàng con đường Hạnh Phúc\n- Dừng chân ở khu vực cột mốc báo 12 km tới Mèo Vạc\n- Ngắm hoàng hôn trên đèo Mã Pì Lèng\n- Di chuyển đến Làng văn hóa dân tộc Mông để nghỉ đêm\n- Khởi hành từ Mèo Vạc về Hà Nội\n\nĐặc sản Hà Giang bao gồm:\n\n- Bánh cuốn trứng với lớp bột ướt mỏng, trứng lòng đào đỏ.\n- Cháo ấu tẩu, vị thuốc bổ giải cảm, nấu bằng gạo nếp, chân giò và củ ấu.\n- Bánh chưng gù, được gói bằng tay, có màu xanh hoặc đen tùy loại gạo.\n- Thắng dền, giống bánh trôi tàu, làm từ bột gạo nếp.\n- Thắng cố, có mùi thơm của thảo quả, hạt dổi, vị béo ngậy của thịt.\n- Cháo ấu tẩu, ăn giải rượu, chống đau nhức xương khớp.\n- Bánh tam giác mạch, đặc trưng của người Mông, vị thơm, ngọt nhẹ.\n- Cơm lam Bắc Mê, đặc sản của đồng bào dân tộc Tày, có mùi thơm phức.\n\nHà Giang nổi tiếng với những món quà đặc sản như:\n\n- Trái chín mọng ngọt ngào\n- Lạp xưởng gác bếp được ướp muối, đường, bột ngọt, rượu trắng và mắc mật khô, mang hương vị đặc trưng khó quên.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "33",
            "Nighttime temperature (°C)": "22",
            "Precipitation (mm)": "219",
            "UV Index": "7",
            "Typhoon season": "Typhoon",
            "Best month": "No"
        }
    }
]