[
    {
        "city": "Quảng Nam",
        "geo_features": {
            "Núi đồi": "1",
            "Rừng": "1",
            "Bãi biển": "1",
            "Thành phố": "1",
            "Làng mạc": "1",
            "Hang động": "1",
            "Suối": "1"
        },
        "tourist_activities": {
            "Công viên": 1,
            "Di tích lịch sử & văn hóa": 1,
            "Hoạt động ngoài trời & mạo hiểm": 1,
            "Hoạt động dưới nước": 1,
            "Trải nghiệm ẩm thực": 1,
            "Lễ hội": 0,
            "Thư giãn & chăm sóc sức khỏe": 1,
            "Cuộc sống về đêm": 0,
            "Thiên nhiên & động vật hoang dã": 1,
            "Mua sắm": 1
        },
        "description": "Có nhiều phương tiện để đến Quảng Nam, bao gồm:\n\n- Đường hàng không: Sân bay Đà Nẵng hoặc Chu Lai\n- Đường sắt: Các đôi tàu Thống Nhất từ Hà Nội và TP HCM\n- Đường bộ: Xe khách, xe buýt, taxi, xe dịch vụ\n- Đường biển: Cảng Trường Hải ở khu kinh tế mở Chu Lai, tàu cao tốc từ biển Cửa Đại đến Cù Lao Chàm\n\nGiá vé và thời gian di chuyển tùy thuộc vào phương tiện và tuyến đường.\n\nQuảng Nam là địa phương phát triển mạnh về du lịch với nhiều lựa chọn lưu trú. Các resort ven biển như Four Seasons Resort The Nam Hai và Victoria Hoi An Beach Resort & Spa có giá từ 1-100 triệu đồng một đêm. Khách sạn và homestay ở Hội An và Tam Kỳ có giá từ 300.000-1,2 triệu đồng một đêm.\n\nHội An là một trong hai Di sản văn hoá thế giới của tỉnh Quảng Nam, nổi tiếng với giá trị văn hoá và kiến trúc cổ. Ngoài ra, có nhiều điểm du lịch khác như:\n\n- Rừng dừa Bảy Mẫu: khu du lịch sinh thái nổi tiếng với rừng dừa xanh và các hoạt động như múa thúng, đua thuyền.\n- Thánh địa Mỹ Sơn: thánh địa Ấn Độ giáo của Vương quốc Chăm Pa xưa, với 70 công trình đền tháp được chia thành nhiều cụm.\n- Cù Lao Chàm: đảo bảo tồn hệ sinh thái biển với 950 loài thủy sinh, nơi du khách có thể khám phá, đi câu cá, lặn ngắm san hô.\n- Làng bích họa Tam Thanh: làng có khoảng 30 bức tranh sắc màu rực rỡ phủ trên những bức tường cũ.\n- Bãi biển Cửa Đại: bãi biển đẹp với nước xanh trong, cát trắng, thoai thoải, thích hợp để tắm.\n- Hồ Phú Ninh: địa điểm du lịch sinh thái nổi bật với khí hậu mát mẻ, rừng nguyên sinh và hơn 20 đảo lớn.\n- Tượng đài mẹ Thứ: tượng đài tưởng niệm Mẹ Việt Nam Anh hùng Nguyễn Thị Thứ, nơi có quy mô lớn nhất Đông Nam Á.\n- Làng gốm Thanh Hà: nơi bạn có thể ngắm nhìn những sản phẩm gốm mỹ nghệ tinh xảo được làm từ bàn tay của những nghệ nhân xứ Thanh Hà.\n\nẨm thực Quảng Nam nổi tiếng với các món ăn đặc trưng như:\n\n- Bê thui: Món ăn phổ biến ở miền Trung, được làm từ bê 4-5 tháng tuổi, thui trên than lửa và ăn kèm với mắm nêm, rau sống và bánh tráng cuốn.\n- Mì Quảng: Món ăn có nguồn gốc từ Quảng Nam, được làm từ bột gạo xay mịn, tráng thành từng lớp, và ăn kèm với rau sống, thịt lợn, tôm, thịt gà và nước dùng.\n- Cao lầu: Món ăn đặc sản của Hội An, được làm từ sợi mì vàng, dùng cùng tôm, thịt lợn, rau sống và nước dùng.\n- Cơm gà: Món ăn phổ biến ở Tam Kỳ và Hội An, được làm từ cơm dẻo, thơm, thịt gà chắc, ngậy, lòng gà đậm vị và đu đủ bào giòn.\n- Các món phổ biến khác như bánh tráng cuốn thịt heo, bánh canh, bánh mì, bánh bột lọc và nem nướng.\n\n",
        "climate_data": {
            "Daytime temperature (°C)": "27",
            "Nighttime temperature (°C)": "21",
            "Precipitation (mm)": "26",
            "UV Index": "7",
            "Typhoon season": "",
            "Best month": "Yes"
        },
        "current_temperature_2m": "28 °C",
        "current_rain": "0 mm",
        "next_7_days_weather": {
            "date": [
                "2025-05-16",
                "2025-05-17",
                "2025-05-18",
                "2025-05-19",
                "2025-05-20",
                "2025-05-21",
                "2025-05-22"
            ],
            "temperature_2m_max": [
                "35 °C",
                "36 °C",
                "36 °C",
                "37 °C",
                "37 °C",
                "37 °C",
                "37 °C"
            ],
            "temperature_2m_min": [
                "26 °C",
                "26 °C",
                "26 °C",
                "26 °C",
                "26 °C",
                "27 °C",
                "26 °C"
            ],
            "uv_index_max": [
                "9",
                "9",
                "9",
                "9",
                "8",
                "9",
                "9"
            ],
            "precipitation_sum": [
                "0 mm",
                "0 mm",
                "4 mm",
                "10 mm",
                "6 mm",
                "1 mm",
                "10 mm"
            ]
        },
        "month": 2,
        "warning_promotion": "Quảng Nam là một điểm đến hấp dẫn với nhiều sự kiện nổi bật. Gần đây, tỉnh đã tổ chức lễ kỷ niệm 70 năm Ngày Thầy thuốc Việt Nam và khai giảng Câu lạc bộ tiếng Anh dành cho tài xế xích lô. Trong tương lai, Quảng Nam sẽ tổ chức Hội thảo Lữ hành quốc tế từ ngày 6-9/3/2025 tại Hội An, Mỹ Sơn và Khu du lịch sinh thái Cổng Trời Đông Giang. Du khách cần lưu ý tình hình giao thông và an ninh, đặc biệt là tại các khu vực đông đúc và các điểm du lịch nổi tiếng. Quảng Nam hứa hẹn mang đến nhiều trải nghiệm thú vị và đa dạng.",
        "weather_favorability_score": 2.0
    }
]